#### **Задача 1** 

##### Постановка задачи: **Генерация треугольника Паскаля. Напишите программу, которая выводит первые N строк треугольника Паскаля.**
##### Математическая модель:
$$
row[i] = previousRow[i - 1] + previousRow[i]
$$
##### Список идентификаторов:

| Имя               | Тип  | Смысл                                                    |
| ----------------- | ---- | -------------------------------------------------------- |
| N                 | int  | Количество строк треугольника , вводимая с клавиутуру    |
| triangle          | int  | Указатель на указатель , для хранения всего треугольника |
| currentRowSize    | int  | Размер текущей строки                                    |
| i                 | int  | Параметр цикла                                           |
| printRow          | void | Функция для печати строки треугольника с отступами       |
| row               | int  | Указатель на массив с числами строки                     |
| maxSize           | int  | Общее количество строк в треугольникt                    |
| currentSize       | int  | Количество элементов в текущей строке                    |
| generatePascalRow | int  | Функция для генерации строки треугольника Паскаля        |

##### Код программы:
```
#include <stdio.h>

#include <stdlib.h>

  

/* Функция для печати строки треугольника с отступами

 row - указатель на массив с числами строки

 currentSize - количество элементов в текущей строке

 maxSize - общее количество строк в треугольнике */

void printRow(int* row, int currentSize, int maxSize) {

    // Вычисляем количество отступов перед строкой для центрирования

    int padding = maxSize - currentSize;

    // Печатаем отступы (по 2 пробела на каждый уровень)

    for (int i = 0; i < padding ; i++) {

        printf("  ");

    }

    // Печатаем элементы строки с фиксированной шириной

    for (int i = 0; i < currentSize; i++) {

        printf("%4d", row[i]); // %4d обеспечивает выравнивание чисел

    }

    printf("\n");

}

  

/* Функция для генерации строки треугольника Паскаля

 previousRow - указатель на предыдущую строку

 currentRowSize - размер текущей строки*/

int* generatePascalRow(int* previousRow, int currentRowSize) {

    // Выделяем память для новой строки

    int* row = (int*)malloc(currentRowSize * sizeof(int));

    // Первый и последний элементы всегда равны 1

    row[0] = 1;

    row[currentRowSize - 1] = 1;

    // Заполняем средние элементы как сумму элементов из предыдущей строки

    for (int i = 1; i < currentRowSize - 1; i++) {

        row[i] = previousRow[i - 1] + previousRow[i];

    }

    return row;

}

  

int main(void) {

    int N;

    printf("Enter the number of Pascal's triangle rows: ");

    scanf("%d", &N);

    // Проверка корректности ввода

    if (N <= 0) {

        printf("Number of rows must be positive\n");

        return 1;

    }

    // Выделяем память для массива указателей на строки

    int** triangle = (int**)malloc(N * sizeof(int*));

    // Генерируем строки треугольника

    for (int i = 0; i < N; i++) {

        int currentRowSize = i + 1;

        if (i == 0) {

            // Первая строка содержит только 1

            triangle[i] = (int*)malloc(sizeof(int));

            triangle[i][0] = 1;

        } else {

            // Генерируем строку на основе предыдущей

            triangle[i] = generatePascalRow(triangle[i - 1], currentRowSize);

        }

        // Печатаем текущую строку

        printRow(triangle[i], currentRowSize, N);

    }

    // Освобождаем память

    for (int i = 0; i < N; i++) {

        free(triangle[i]);

    }

    free(triangle);

    return 0;

}
```
##### Результат работы программы:


#### **Задача 2** 

##### Постановка задачи: 
##### Математическая модель:
##### Список идентификаторов:
##### Код программы:
##### Результат работы программы:

#### **Задача 3** 

##### Постановка задачи: 
##### Математическая модель:
##### Список идентификаторов:
##### Код программы:
##### Результат работы программы:

#### **Задача 4** 

##### Постановка задачи: 
##### Математическая модель:
##### Список идентификаторов:
##### Код программы:
##### Результат работы программы: