#### **Задача 1** Динамический массив и вычисление среднего арифметического 

##### Постановка задачи: 
Напишите программу на языке Си, которая: • Запрашивает у пользователя количество элементов массива (целое число N). • Динамически выделяет память для массива из N элементов типа float. • Заполняет массив значениями, введёнными с клавиатуры. • Вычисляет и выводит среднее арифметическое всех элементов массива. • При обращении к элементам массива используйте арифметику указателей (без оператора []). • Освобождает выделенную память в конце работы программы.
##### Математическая модель:
$$
	sr = sum /n
$$
##### Список идентификаторов:

| Имя  | Тип   | Смысл                          |
| ---- | ----- | ------------------------------ |
| n    | int   | Размер массива                 |
| *arr | float | Указатель на массив            |
| i    | int   | Параметр цикла                 |
| sum  | int   | Сумма элементов массива        |
| sr   | float | Среднее арифметическое массива |

##### Код программы:
```
#include <Windows.h>

#include <math.h>

#include <stdio.h>

#include <stdlib.h>

  

int main(void){

    SetConsoleOutputCP(CP_UTF8);

    int n;

    float *arr;

  

    printf("Введите размер массива: ");

    scanf("%d", &n);

  

    arr = (float *)malloc(n * sizeof(float));

  

    printf("Введите %d чисел:\n", n);

    for (int i = 0; i < n; i++) {

        scanf("%f", arr+i);  // &arr[i]

    }

  

    printf("Элементы массива:\n");

    for (int i = 0; i < n; i++) {

        printf("%.2f ", *(arr+i));  // arr[i]

    };

    printf("\n");

    int sum = 0;

    for (int i = 0; i<n; i++){

        sum += arr[i];

    }

    float sr = sum /n;

    printf("Срденее арифметическое:\n");

    printf("%f", sr);

    printf("\n");

    free(arr);

  

    return 0;

}
```
##### Результат работы программы:

#### **Задача 2** Каталог книг

##### Постановка задачи: 
Создайте структуру Book, которая содержит следующие поля: • title – массив символов (строка) для хранения названия книги (максимум 50 символов); • author – массив символов для хранения имени автора (максимум 50 символов); • year – целое число, обозначающее год издания книги. Напишите программу, которая: • Создаёт массив из 3-х экземпляров структуры Book. • Запрашивает у пользователя данные для каждой книги (название, автора и год издания). • Выводит информацию обо всех книгах на экран, используя для этого отдельную функцию printBook(), которая принимает указатель на структуру Book.

##### Список идентификаторов:

| Имя       | Тип         | Смысл                                 |
| --------- | ----------- | ------------------------------------- |
| Book      | struct      | Структура книги                       |
| title     | char        | Название книги                        |
| author    | char        | Автор книги                           |
| year      | int         | Год выпуска книги                     |
| printBook | void        | Функция для вывода информации о книге |
| books[3]  | struct Book | Массив трёх книг                      |
| i         | int         | Параметр цикла                        |

##### Код программы:
```
#include <Windows.h>

#include <math.h>

#include <stdio.h>

#include <stdlib.h>

  

struct Book {

    char title[50];

    char author[50];

    int year;

};

  

// Функция для вывода информации о книге

void printBook(struct Book *book) {

    SetConsoleOutputCP(CP_UTF8);

    printf("Название: %s", book->title);

    printf("Автор: %s", book->author);

    printf("Год издания: %d\n\n", book->year);

}

  

int main() {

    SetConsoleOutputCP(CP_UTF8);

    struct Book books[3];

  

    for (int i = 0; i < 3; i++) {

        printf("Введите данные для книги %d:\n", i + 1);

  

        printf("Название: ");

        fgets(books[i].title, 50, stdin);

  

        printf("Автор: ");

        fgets(books[i].author, 50, stdin);

  

        printf("Год издания: ");

        scanf("%d", &books[i].year);

        while (getchar() != '\n'); // Очистка ввода

    }

  

    // Вывод информации о всех книгах

    printf("\nИнформация о книгах:\n");

    for (int i = 0; i < 3; i++) {

        printBook(&books[i]);

    }

  

    free(books);

  

    return 0;

}
```
##### Результат работы программы:

#### **Задача 3** Определение сезона по номеру месяца

##### Постановка задачи: 
Создайте перечисление Season со следующими значениями: • WINTER, SPRING, SUMMER, AUTUMN Напишите программу, которая: • Запрашивает у пользователя номер месяца (целое число от 1 до 12). • На основе введённого номера месяца определяет и выводит соответствующий сезон: – Зима: декабрь (12), январь (1) и февраль (2); – Весна: март (3), апрель (4) и май (5); – Лето: июнь (6), июль (7) и август (8); – Осень: сентябрь (9), октябрь (10) и ноябрь (11). • Для определения сезона можно использовать условные операторы (if-else) или конструкцию switch.
##### Математическая модель:
##### Список идентификаторов:

| Имя     | Тип         | Смысл        |
| ------- | ----------- | ------------ |
| Seasons | enum        | Времена года |
| month   | int         | Месяц        |

##### Код программы:
```
#include <Windows.h>

#include <math.h>

#include <stdio.h>

  
  

enum Season {

    WINTER,

    SPRING,

    SUMMER,

    AUTUMN

};

  

int main() {

    SetConsoleOutputCP(CP_UTF8);

    int month;

    enum Season season;

  

    printf("Введите номер месяца (1-12): ");

    scanf("%d", &month);

  

    if (month < 1 || month > 12) {

        printf("Ошибка: номер месяца должен быть от 1 до 12.\n");

        return 1;

    }

  

    if (month == 12 || month <=2) {

        season = WINTER;

    } else if (month >= 3 && month <= 5) {

        season = SPRING;

    } else if (month >= 6 && month <= 8) {

        season = SUMMER;

    } else {

        season = AUTUMN;

    }

  

    switch (season) {

        case WINTER:

            printf("Сезон: Зима\n");

            break;

        case SPRING:

            printf("Сезон: Весна\n");

            break;

        case SUMMER:

            printf("Сезон: Лето\n");

            break;

        case AUTUMN:

            printf("Сезон: Осень\n");

            break;

    }

    return 0;

}
```
##### Результат работы программы: